Assignment Instructions:

1.Design a relational database for an education system, which fulfils the following requirements:

* Information of departments, programs, students, teachers and courses are stored in the databases.
* The relationships of departments, programs, students, teachers and courses are stored in the databases.
* Departments provide different programs. Each program belongs to one department.
* Each course has at least one teacher. It is possible that one course has two or more teachers. And each course is hosted by one department.
* Each teacher belongs to one department.
* Each program has several courses. It is possible that one course is shared by two or more different programs.
* Each student belongs to one program.
* At one semester, students can choose different courses which belong to their programs.
* There are mandatory and elective courses. It is possible for a student to choose elective courses from other programs.
* Each course has its own credits.
* There is a maximam limit of total credits that students can get in one semester. This means there is a limit of number of courses one student can chose at each semester.
* Some courses have pre-course requirements. And some courses cannot be chosen at the same time.
* Design queries that are useful for teachers, students, student adminitrators. For example, how many credits a student has obtained? how many are mandatory credits? How many more mandatory/elective credits s/he has to obtain to graduate?

2.To design a databse step by step, read this [Quick-Start Tutorial on Relational Database Design](https://www.ntu.edu.sg/home/ehchua/programming/sql/Relational_Database_Design.html).
 

3.Create tables based on your design for this education system in the provided empty SQLite database "empty_db.db". For each table, the description of table and the corresponding create sql need to be listed in the notebook. One simple example has been given.

* Rename the db file as ""
* Command for "show tables" with ipython-sql: "%sql SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;"
* Command for "describe tables" with ipython-sql: "%sql PRAGMA table_info(Table_Name);"
* If working with a shell or DOS prompt, Sqlite also provides command ".tables" and ".schema Table_Name".
* More information on Sqlite can be found at [Sqlite Quick Start](https://sqlite.org/quickstart.html)

In [1]:
%load_ext sql

C:\Users\olavt\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Users\olavt\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

(sqlite3.OperationalError) near "DATABASE": syntax error [SQL: 'DROP DATABASE :///A3database.db']

Example:

Table: student

Description: Information of students are stored in this table, such as name and email.

In [2]:
%sql sqlite:///A3database.db

'Connected: None@A3database.db'

In [37]:
%%sql 
DROP TABLE IF EXISTS department;
CREATE TABLE department (
    dID int NOT NULL UNIQUE,
    name varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(dID)
);
INSERT INTO department VALUES (1, "Economy"), (2, "Science");
select *
from department

Done.
Done.
2 rows affected.
Done.

[(1, 'Economy'), (2, 'Science')]

In [54]:
%%sql
DROP TABLE IF EXISTS course;
CREATE TABLE course (
    cID int NOT NULL UNIQUE,
    name varchar(255) NOT NULL DEFAULT '',
    credit int CHECK (credit<=10) NOT NULL,
    mandatory bool,
    PRIMARY KEY(cID)
);

INSERT INTO course VALUES (1, "Economy", 5, 1), 
                            (2, "ComputerScience", 10, 1), 
                            (3, "Math", 10, 1),
                            (4, "Database", 10, 1), 
                            (5, "DiscreteMath", 10, 1);
select *
from course

Done.
Done.
5 rows affected.
Done.

[(1, 'Economy', 5, 1),
 (2, 'ComputerScience', 10, 1),
 (3, 'Math', 10, 1),
 (4, 'Database', 10, 1),
 (5, 'DiscreteMath', 10, 1)]

In [56]:
%%sql
DROP TABLE IF EXISTS program;
CREATE TABLE program (
    pID int NOT NULL UNIQUE,
    dID int,
    name varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(pID),
    FOREIGN KEY (dID) REFERENCES department(dID)
);

INSERT INTO program VALUES (1, 2, "Computer"), 
                            (2, 2, "Auto"), 
                            (3, 2, "Electro"),
                            (4, 1, "Economy"), 
                            (5, 1, "GlobalEconomy");
select *
from program

Done.
Done.
5 rows affected.
Done.

[(1, 2, 'Computer'),
 (2, 2, 'Auto'),
 (3, 2, 'Electro'),
 (4, 1, 'Economy'),
 (5, 1, 'GlobalEconomy')]

In [61]:
%%sql 
DROP TABLE IF EXISTS student;
CREATE TABLE student (
    sID int NOT NULL UNIQUE,
    pID int,
    first_name varchar(255) NOT NULL DEFAULT '',
    last_name varchar(255) NOT NULL DEFAULT '',
    email varchar(255) NOT NULL DEFAULT '',
    credits int CHECK (credits<=30) NOT NULL,
    PRIMARY KEY(sID),
    FOREIGN KEY (pID) REFERENCES program(pID)
);
INSERT INTO student VALUES (1, 2, "Olav", "Telseth", "olav@ntnu.stud.no", 0), 
                            (2, 2, "Simon", "Synnes", "simon@ntnu.stud.no", 0), 
                            (3, 2, "Einar", "Weltan", "einar@ntnu.stud.no", 0),
                            (4, 1, "Truls", "Trulsens", "truls@ntnu.stud.no", 0), 
                            (5, 1, "Geir", "Geirsen", "geir@ntnu.stud.no", 0);
select *
from student

Done.
Done.
5 rows affected.
Done.

[(1, 2, 'Olav', 'Telseth', 'olav@ntnu.stud.no', 0),
 (2, 2, 'Simon', 'Synnes', 'simon@ntnu.stud.no', 0),
 (3, 2, 'Einar', 'Weltan', 'einar@ntnu.stud.no', 0),
 (4, 1, 'Truls', 'Trulsens', 'truls@ntnu.stud.no', 0),
 (5, 1, 'Geir', 'Geirsen', 'geir@ntnu.stud.no', 0)]

In [63]:
%%sql 
DROP TABLE IF EXISTS teacher;
CREATE TABLE teacher (
    tID int NOT NULL UNIQUE,
    dID int NOT NULL,
    first_name varchar(255) NOT NULL DEFAULT '',
    last_name varchar(255) NOT NULL DEFAULT '',
    email varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(tID),
    FOREIGN KEY (dID) REFERENCES department (dID)
);
INSERT INTO teacher VALUES (1, 2, "Hao", "Wang", "Wang@Mail.no"), 
                            (2, 2, "Girts", "Strazdin", "Strazdin@Mail.no"), 
                            (3, 2, "Bob", "Bobbyson", "Bobbyson@Mail.no");
select *
from teacher

Done.
Done.
3 rows affected.
Done.

[(1, 2, 'Hao', 'Wang', 'Wang@Mail.no'),
 (2, 2, 'Girts', 'Strazdin', 'Strazdin@Mail.no'),
 (3, 2, 'Bob', 'Bobbyson', 'Bobbyson@Mail.no')]

Making the relationstables

In [65]:
%%sql
DROP TABLE IF EXISTS enrollment;
CREATE TABLE enrollment (
    sID int NOT NULL,
    cID int NOT NULL,
    grade int NOT NULL,
    PRIMARY KEY(sID, cID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (sID) REFERENCES student(sID)
);

INSERT INTO enrollment VALUES (1, 2, 5), (2, 2, 4), (3, 2, 6);
select *
from enrollment;

Done.
Done.
3 rows affected.
Done.

[(1, 2, 5), (2, 2, 4), (3, 2, 6)]

In [66]:
%%sql
DROP TABLE IF EXISTS lecture;
CREATE TABLE lecture (
    cID int NOT NULL,
    tID int NOT NULL,
    PRIMARY KEY(cID, tID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (tID) REFERENCES teacher(tID)
);

INSERT INTO lecture VALUES (1, 1), (2, 2), (3, 3);
select *
from lecture;

Done.
Done.
3 rows affected.
Done.

[(1, 1), (2, 2), (3, 3)]

In [67]:
%%sql
DROP TABLE IF EXISTS courses;
CREATE TABLE courses (
    cID int NOT NULL,
    pID int NOT NULL,
    PRIMARY KEY(cID, pID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (pID) REFERENCES program(pID)
);

INSERT INTO courses VALUES (1, 1), (1, 2);
select *
from courses;

Done.
Done.
2 rows affected.
Done.

[(1, 1), (1, 2)]